src/cf/InformationRegisters/ЖурналСинхронизацииМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЖурналСинхронизацииМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФормированиеПакетовНаКлиенте</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыФормированияПакетовМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормированиеПакетовНаСервере</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыФормированияПакетовМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияБазыСКоторойИдетОбмен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторФоновогоЗаданияНаСервере</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИВремяПоследнегоПушУведомления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтатусСинхронизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСинхронизацииМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.СинхронизацияМП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаИВремяПоследнейСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/СинхронизацияПушУведомленияМПУНФ/Ext/Module.bsl
#Область ПушУведомления

Функция КлючДоступаОтправителяМПУНФ()
	
	Возврат "PUSH_SRV_API_KEY_FBB07761_C058_4109_9577_3AF19669338E";
	
КонецФункции

Процедура ОтправитьПушУведомление(КодУзла) Экспорт
	
	Узел = ПланыОбмена.СинхронизацияМП.НайтиПоКоду(КодУзла);
	
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		Возврат;	
	КонецЕсли;
	
	УзелОбъект = Узел.ПолучитьОбъект();
	УзелОбъект.ДобавленыНовыеДанные = Ложь;
	УзелОбъект.Записать();
	
	Уведомление = Неопределено;
	Пользователь = Неопределено;
	
	СформироватьУведомление(Уведомление, Пользователь);
	
	Выборка = ПланыОбмена.СинхронизацияМП.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ИдентификаторПодписчикаДоставляемыхУведомлений = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.Код = КодУзла ИЛИ Выборка.Код = "001" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Пользователь <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ РегистрыСведений.ЖурналСинхронизацииМП.ПушУведомлениеНеБылоОтправлено(Выборка.Код) Тогда
			Продолжить;
		КонецЕсли;
		
		Идентификатор = Выборка.ИдентификаторПодписчикаДоставляемыхУведомлений.Получить();
		
		Если Идентификатор = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Идентификатор.ТипПодписчика = ТипПодписчикаДоставляемыхУведомлений.APNS Тогда // Исключаем отправку на IOS
			Продолжить;
		КонецЕсли;
		
		Уведомление.Получатели.Очистить();
		Уведомление.Получатели.Добавить(Идентификатор);
		
		УдаленныеТокены = Новый Массив;
		
		Попытка
			ОтправкаДоставляемыхУведомлений.Отправить(Уведомление, КлючДоступаОтправителяМПУНФ(), УдаленныеТокены, Истина);
			
			СтруктураЗаписи = Новый Структура("Узел, ДатаИВремяПоследнегоПушУведомления", ПланыОбмена.СинхронизацияМП.НайтиПоКоду(Выборка.Код), ТекущаяДатаСеанса());
			РегистрыСведений.ЖурналСинхронизацииМП.ЗаписатьИнформацию(СтруктураЗаписи);
			
		Исключение
			Инфо = ИнформацияОбОшибке();
			ПолноеОписание = ПодробноеПредставлениеОшибки(Инфо);
		КонецПопытки;
		
		НеИспользоватьИдентификаторы(УдаленныеТокены);
		
	КонецЦикла;
		
КонецПроцедуры

Функция СформироватьУведомление(Уведомление, Пользователь)
	
	Уведомление = Новый ДоставляемоеУведомление();
	Уведомление.Текст = "На сервере изменились данные. Нажмите, чтобы обновить базу.";
	Уведомление.Заголовок = НСтр("ru = '1C:УНФ на мобильном'");
	
КонецФункции

Процедура НеИспользоватьИдентификаторы(Токены)
	
	Если Токены.Количество() > 0 Тогда
		
		Выборка = ПланыОбмена.СинхронизацияМП.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.ИдентификаторПодписчикаДоставляемыхУведомлений <> Неопределено Тогда
				
				Идентификатор = Выборка.ИдентификаторПодписчикаДоставляемыхУведомлений.Получить();
				Если Идентификатор <> Неопределено И Токены.Найти(Идентификатор.ИдентификаторУстройства) Тогда
					
					Узел = Выборка.ПолучитьОбъект();
					
					Узел.ИдентификаторПодписчикаДоставляемыхУведомлений = Неопределено;
					
					Узел.Записать();
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
